[{"title":"冬季取暖攻略","slug":"冬季取暖攻略","date":"2017-12-10T08:50:27.000Z","updated":"2017-12-10T09:55:16.586Z","comments":true,"path":"year/12/10/冬季取暖攻略/","link":"","permalink":"http://www.yangshiqi.cn/year/12/10/冬季取暖攻略/","excerpt":"起因:作为以为生活在帝都的北方人，老家的房子因为年代久远，冬季室内寒冷难耐，所以需要选择一种取暖方式，经过几天的查找总结，写下一片自己的攻略，供家人和能查到我这篇攻略的网友们参考一下。","text":"起因:作为以为生活在帝都的北方人，老家的房子因为年代久远，冬季室内寒冷难耐，所以需要选择一种取暖方式，经过几天的查找总结，写下一片自己的攻略，供家人和能查到我这篇攻略的网友们参考一下。 既然是一篇攻略，我们就从基础分析根据预算分析一下整个流程所需要的东西。前面都是摘自百度百科的，可以看一下，如果不想看的话可以直接转到正文 下面是百度”燃气壁挂炉采暖炉”的解释燃气壁挂式采暖炉是风行欧洲几十年的成熟产品。“壁挂炉”一词属于外来语，全称是：“燃气壁挂式采暖炉”，我国标准名称为：“燃气壁挂式快速采暖热水器”，但它却不是传统意义上的燃气热水器，与热水器有着本质的区别。具有防冻保护、放干烧保护、意外熄火保护、温度过高保护、水泵防卡死保护等多种安全保护措施。可以外接室内温度控制器，以实现个性化温度调节和达到节能的目的。燃气壁挂炉具有强大的家庭中央供暖功能，能满足多居室的采暖需求，并且能够提供大流量恒温卫生热水，供家庭沐浴、厨房等场所使用。 组成部分1）、外壳部份：燃气壁挂炉的外壳主要分为底壳和面壳两部分。2）、燃气锅炉电器控制部份：燃气壁挂炉的电器部分是非常重要的，主要是用来控制、轮回水泵、风机、风压开关、燃气阀、轮回水流、地暖温度探测器等装置的运行。3）、主控板锅炉的主控板主要接收和输出控制信号。4）、风机：燃气锅炉上的分机主要由电机、风轮、风机壳、冷却风扇、传压接头等组成。5）燃气阀门燃气阀门分为比例阀和阀体。 选购1、选品牌，一般而言，选择了好的品牌就选择了安全，选择了省气，选择了省心，选择了服务。各厂商在推销自己的产品时，都能口吐莲花，百般承诺，而真正能按承诺做的则不多。因为没有足够的能力和财力是无法支撑售后服务的，也无法保证配件的及时供应。大多的用户都比较信赖原装进口壁挂炉，原装进口壁挂炉一定有海关报表，要求厂家提供原料海关报单，购值发票，到当地有关部门鉴别是否是真正的原装进口，要睁大眼睛开清楚了，避免上当花冤枉钱！另外必须选择有产品保险单的壁挂炉，发生意外后有制造商负责任。2、选功率，同一品牌有各种功率可选。选的功率大，浪费资金，浪费能源。选的功率小，资金和能源浪费小，但达不到使用要求。选购的时候还要注意一下国家能效标识。现在市面上最好的壁挂炉产品为二级。3、选服务：壁挂炉的寿命在15年以上，除去两年保修还有最少13年的收费维修。在13年漫长的岁月里，如果没有良好的服务为您保驾，那可真成了艰苦岁月。这项选择不能听厂商说，而必须去考查，一看公司规模，二看仓库配件，三看维保站点，四查用户反映。只要把握住以上选择的三个要求，就一定能选到中意的产品。2008年09月01号以号，国家对壁挂炉实行能效等级制度。壁挂炉的能效标准是：燃气热水器国家能效标准可能分三级，第一级为最高等级，满负荷下热效率为96%，测试两点，100%负荷和30%负荷，30%热负荷低4个百分点；第二级为中级，要求满负荷下热效率达到88%，也是测试两点，100%负荷和30%负荷，30%热负荷低4个百分点；第三级为市场准入等级，要求满负荷下热效率为84%，只测试100%的负荷点。鉴于GB6932－2001的测试条件太宽松，将增加测试条件。 保养1、壁挂炉的耗电量大吗?壁挂炉的主要用电部件是排风机和循环水泵，壁挂炉的额定耗电量一般在100~200W之间，不同的产品的耗电量有所不同，可详细查阅各产品的产品使用说明书。2、家里使用燃气壁挂炉危险吗?燃气壁挂炉在欧洲已有40年的使用历史，技术已很成熟。设备配置的各项安全保护措施相当完善，用户可放心使用。3、壁挂炉采暖系统会发生结垢吗?在保证采暖系统密闭良好的情况下，采暖系统初次注入的水量一定，产生的水垢微乎其微，不会对采暖系统产生危险。4、壁挂炉内的卫生热水和采暖热水发生混合吗?壁挂炉内的采暖热水和卫生热水都有其独立的管道系统，二者不发生混合。5、为了防止壁挂炉在冬季家中无人时冻结，可以在壁挂炉系统内加防冻液吗?壁挂炉系统内不能加入化学物质，尤其不能加防冻液。正确的防冻措施应该是：1)家中短时间(一周以内)无人时，可将壁挂炉温度设成最低，这时壁挂炉将以最底温度运行.2)家中长期无人时，可将壁挂炉及采暖系统中的水全部放泄干净。但需注意的是，在此操作之前请充分考虑室内其他管路，如选自来水管绝对不会冻结。否刚请不要关闭壁挂炉，保持其低温运行。6 、使用同轴烟道有什么好处?节省室内空间、提高燃烧效率。7 、壁挂炉内的膨胀水箱的作用是什么?吸纳密闭系统内的水因温度发生变化而产生的膨胀量，保持系统压力稳定。8 、燃气壁挂炉都有哪些安全保护装置?过热保护、缺水保护、燃烧故障保护、系统超压保护、排风安全保护、缺气保护、防冻保护、水泵防抱死、断电，断气自锁保护等几十项防护功能。9 、燃气壁挂炉采暖系统允许的最大水容量由哪些因素决定?壁挂炉内膨胀水箱的有效容积的大小决定系统内允许水容量的大小。10 、燃气壁挂炉工作时，如何汲取新鲜空气及排放燃烧烟气?燃气壁挂炉在工作时，通过独立的进气管与排烟管分别汲取空气和排放废气。二者都与室内空气无关，运行安全可靠。11、三层的别墅可以使用燃气壁挂炉吗?壁挂炉要求安装的密闭系统中，系统压力在1~2bar之间，壁挂炉内置的循环水泵只需克服系统循环的沿程阻力，所以，只要在设计流量下系统的阻力在产品说明书中会提供机外流量-扬程曲线允许范围内，就可直接使用壁挂炉，否则，可参考设备厂家提供的技术资料安装外置循环水泵。 (在壁挂炉额定输出功率满足别墅供热负荷的前提下)12 、冬季采暖时，壁挂炉会24小时连续工作吗?基本不会，壁挂炉输出功率的大小是按照卫生热水负荷和采暖负荷的较大值选取。通常家庭的卫生热水负荷要大于采暖热负荷，所以在设计室内温度下，壁挂炉会按照设定程序自动启停，无需人为干涉。13 、使用燃气壁挂炉洗浴有哪些好处?1)出水量大，一台24Kw的壁挂炉在自来水与热水温差为25℃情况下的产水量为13L/分钟，基本可以满足一个高档淋浴和一个洗手龙头同时使用。2)热水温度稳定。壁挂炉内的温度探头时刻监测热水温度，在用水量变化时，调整壁挂炉输出功率(调节范围30%-100%)使热水出水温度保持稳定。14、如何减少壁挂炉的燃气用量?1)购买住房时，要充分考虑影响房间耗热量的因素，如：围护结构、朝向、楼层等，尽量购买房间耗热量小的居室;2)用户应根据家庭人员工作生活习惯，在一天/一周中不同的时间段设定不同的温度，(可通过配置带编程功能的室温控制器来完成)以避免出现家中无人，而采暖炉仍在高温运行的情况。3)定期维护保养，令壁挂炉始终处于高效状态。15 、影响燃气壁挂炉采暖的燃气消耗量有哪些因素?壁挂采暖炉的耗气量与设备本身并无绝对关系，而主要是由以下几个因素制约：1)室内设定温度;2)室外气候条件;3)通风换气;4)楼层的影响;5)周围房间入住率;6)用户使用方式。16 、选择燃气壁挂炉有哪些优点?1)用户每户自成系统，同时解决采暖和热水供应问题。2)单户燃气壁挂炉采暖具有很大的调节灵活性，使用完全独立，采暖温度可以自主调节，采暖时间可自行控制，各个房间温度可自如的控制，无锅炉房和外热网热损失，节省外网建设投资。3)符合按热量收费的原则，可准确计量耗气量，用气量可由用户自主控制，节约燃气。4)采暖循环的电能消耗低，节省电能，提高燃气管线的利用率和使用经济效益。17 、欧洲标准燃气壁挂炉主要由哪些部分组成?主要由四大部分组成：燃气燃烧系统、采暖循环系统、生活热水循环系统、安全保护控制系统。18 、常见的燃气壁挂炉与散热末端配套方式有哪些?燃气壁挂炉可与散热器系统、地板辐射系统、风机盘管系统等配套。(注意：在系统设计时，一定要校核系统的流量、阻力特性，选择正确的配套方案)19 、燃气壁挂炉能同时提供采暖和卫生热水吗?欧洲标准的燃气壁挂炉采暖和卫生热水模式不能同时运行，卫生热水功能优先，燃气壁挂炉根据卫生热水使用情况在二者间自动切换。20 、燃气壁挂炉有几种运行模式，如何选择?标准燃气壁挂炉提供采暖及卫生热水两种运行模式。在燃气壁挂炉控制面板上会有冬季/夏季两个选择档，在冬季档位，燃气壁挂炉可提供采暖及卫生热水功能，卫生热水功能优先，所以燃气壁挂炉根据用户卫生热水使用情况在采暖及卫生热火模式下，自动切换;在夏季档位，燃气壁挂炉通常处于待机状态，只有在用户使用卫生热水的情况下才进入卫生热水模式工作。所以，用户可在冬季需要采暖及使用卫生热水时选择冬季档，其余时间可选择夏季档，仅使用卫生热水功能。21 、燃气壁挂炉都能提供哪些功能?通常燃气壁挂炉都具有采暖及卫生热水两种功能。同时也有一部分燃气壁挂炉只具有采暖功能，我们称之为单功能系统壁挂炉(它与外置的热水储水罐连接也可以提供卫生热水)。22 、燃气壁挂炉能使用哪些类型的燃气?天然气、液化气，一些专用的机型也可使用人工煤气。23 、我要离家一段日子，这是冬天，我的采暖炉和系统会冻坏吗?把供暖温度调节器调到“最低”位置，就可以防止您的采暖炉及系统装置冻坏(前提条件是每组散热器的节门必须打开)。对长期无人居住的房屋，建议将整个采暖系统中的水全部放掉;或者通过厂家询问特定的防冻保护措施来保护采暖炉及系统。注意：单纯的生活热水遁环，并不能保护您的采暖炉。24 、我的采暖炉停止工作了，机器出现故障YL报警你的采暖炉已经意识到系统中缺水。你必须通过位于采暖炉底部的注水旋钮来注水，使水压在1-1。5bar之间。在这个操作之后，你的采暖炉会自动点燃。如果你需要频繁地注水，很可能是系统漏水所致。出现这种情况后，你一定要和你的供应商联系。25 、我经常听到我家的散热器里面有流水的声音。这可能是有空气存留在水管或散热器中造成的。你可以用打开散热顶端的跑风口，把里面的空气放掉。之后，你必须调节采暖炉的水压并确保压力稳定。这可以通过在采暖炉下面的放水口旋钮完成。26 、在洗澡的时候，我必须等上很长一段时间才能得到热水!无论你的采暖炉处于何种工作状态或你的储水箱容积有多大，出热水的时间是由存留在水管里的冷水量决定的。如果你的浴室离你的储水箱(或采暖炉)10米远，等待出热水的几秒钟感觉会比较长。27 、自从安装了室内温控器，散热器整个下午都是凉的!这正是使用温控器的好处。下午阳光很好的时候温控器会让采暖炉停止工作，充足的光照会让你的房间保持舒适的温度。28 、有时候，当我将热水的水龙头开到最大时，水温好像变低了，是这样的吗?是的。对于瞬时二次板换式采暖炉来说，生活热水的温度取决于水的流速。水流越快，二次板换器对水的加热功能越差。当遇到这种情况时，你只要减小水的流量就可以提升水温了 故障1、压力不足故障故障现象： 水泵不转运转，控制器报警，显示屏显示的故障代码为压力不足。故障原因：1)管道缺水，压力表显示管道水压不足。2)压力开关故障。3)管道系统内有大量的空气。解决办法：1)管道缺水进行补水；如果管道泄漏，想办法堵漏处理。2)用万用表检测，如果压力开关不接通，则更换压力开关；如果接触不良则重新接插好；如果线路断路则更换导线；如果插错端子则按正确接插。3)对管道系统进行排气。2、管道缺水故障（1） 故障现象：水泵不运转，风机不运转，控制器报警，显示屏显示的故障代码为管道缺水。故障原因：1）水泵电源线脱落2)水泵因为长时间不用抱死。解决方法：1)用万用表检测水泵的输出电源是否正常，接触是否良好。如果控制器没有电压输出是控制器故障，更换控制器；如果控制器有电压输出，水泵没电则是接插件脱落，接触不良或者导线断开；脱落就重新接触好，接触不良就使之接触良好，导线断开就更换导线。2)如果有电压输入水泵，而水泵不转，则可能为水泵抱死，拧开水泵上的一字螺丝，用一字螺丝刀拧动水泵轴，使水泵转子旋转就能恢复正常；如果水泵没有抱死而用万用表检测水泵断路或短路，则为水泵烧坏，更换水泵。（2） 故障现象水泵运转，风机不运转，控制器报警，显示屏显示的为管道缺少故障代码。故障原因：1) 水泵有空气没有排尽导致水泵空转。2) 采暖系统分配器没有打开或者过滤器堵塞。3) 管道内有空气没有排尽。4) 水流开关故障。5) 压差式机型管道产生的压差不够。解决方法：1) 拧开水泵端面一字口铜螺丝，排尽水泵空气，重新启动。2) 采暖系统分配器没有打开则打开分配器；如果过滤器堵塞则拆下过滤器冲洗干净之后装好，进行补水排气，重新启动。3) 管道内有空气没有排尽则排尽空气重新启动。4) 水流开关故障就用万用表检测在运行时是否有开关信号输出。如果有信号输出即水流开关接通，可能为接插件接插不好或导线断开，则接插好接插件或更换导线；如果导线及接插均完好，则为控制器故障，更换控制器。如果没有信号输出则为水流开关卡死或者水路堵塞；水流开关卡死则拆下水流开关冲洗再装回；并进行补水。排气再重新启动；水路堵塞按b方法处理。5) 在采暖出水口装一个分配器（开关），关小一点分配器既可。 清洗除垢1、打开进水口；2、将壁挂炉清洁剂与水按1：10（体积比）的比例混合，配成清除液加入到存水箱；对于顽固水垢可直接倒入原液，浸泡5-15分钟即可，轻松瓦解水垢。3、让其自动热循环（浸泡）20-30分钟，从排水口直接排干清洗液；4、打开进水口，加满水后再循环两分钟；5、排干后即可正常使用。 安全事项必须要保证壁挂炉烟管的吸、排气通畅。壁挂炉烟管的构造为直径60㎜/100㎜的双芯管，锅炉工作时由外管吸入新鲜空气，内管排出燃烧废气。锅炉燃烧时需要吸入的空气量大约为40㎡/h ，所以产生的废气量也较多。因此业主在装修封闭阳台或移机时，必须将烟管的吸、排口伸出窗外，不得将其封在室内或是使用单芯管，否则锅炉在燃烧时容易将排出的废气吸回，造成燃烧时供氧不足，极易导致锅炉发生爆燃、点不着火、或频繁启动等现象，给生命财产安全留下隐患。壁挂炉在工作时，底部的暖气、热水出水管、烟管温度较高，严禁触摸，以免烫伤。注意：烟管的拆装最好由专业人员操作，以避免烟管接口处密封不严，引发事故。 正文我们从头开始梳理一下我们所需的东西，从大的方面分析1.燃气壁挂炉采暖炉(简称壁挂炉)2.暖气片3.管道4.根据各家的布局合理的分布管路和暖气片的摆放 根据这些东西的话咱们就可以开始分析了，哈哈 壁挂炉分析下面是查询到的壁挂炉十大品牌 威能 德国威能总部在德国北莱茵-威斯法伦州Remscheid市，拥有140多年的发展历史，是欧洲出色的供热/生活热水/通风及空调设备制造商，也是顶尖家用燃气壁挂炉制造商。德国威能在中国最早的经营活动可追溯到1955年，随着六十万台燃气热水器相继在香港安装，迈出了其在中国供热领域的第一步。1995年，德国威能正式进入中国市场，成立威能(北京)供暖设备有限公司，承担起在国内的营销、服务、采购、生产和研发等业务。 博世热力 博世热动技术部是罗伯特•博世集团的消费品及建筑智能化技术部的一个分部，是罗伯特•博世集团最为国际化的事业部之一。其产品十分广泛，包括壁挂式燃气采暖炉、燃气热水器、家用通风系统、太阳能收集器及全套配件等。博世热动技术部生产的壁挂式燃气采暖炉在欧洲傲踞群雄，是市场领导者。特别在2003年与德国布德鲁斯有限公司合并后，博世热力技术已成为欧洲最大的燃气锅炉供应商之一。 小松鼠 广州迪森家居环境技术有限公司成立于2000 年，位于广州市经济开发区东区迪森工业园，是我国最早生产家用壁挂炉的企业之一，为土木工程学会燃气供热专业委员会第一副主任委员单位，中国建筑金属结构协会辐射供暖供冷委员会副主任委员单位及中国土木工程学会燃气应用分会委员单位。在做强国内市场的同时，小松鼠品牌在国际市场上也取得巨大成功，目前已远销法国、德国、西班牙、乌克兰、俄罗斯、阿根廷、希腊、匈牙利、智利、土耳其、伊朗、巴基斯坦、亚美尼亚等几十个国家和地区，真正做到“源自欧洲，出口欧洲”，以“专业壁挂炉国际制造商”的美誉传遍全球。 八喜 BAXI公司起源于英国，以强大的研发队伍与世界领先的生产基地作支撑，凭借着出色的产品与服务，屡获英国服务类大奖，产品远销全球五十多个国家，是欧洲三大供暖企业之一。 1995年，BAXI入驻中国，开始扎根国内供暖市场。 2012年，推出“英国BAXI 您贴心的英伦管家”的理念，并借助微信APP等移动平台整合线下活动，让“英伦管家”的服务理念深入消费者，以卓越供暖产品赢得信任;为消费者提供更贴心的服务，温暖亿万家庭。 万和 万和公司成立于1993年8月，目前已发展成为中国热水器、厨房电器、热水系统专业制造龙头企业，在顺德、中山、高明、合肥等地拥有七大生产制造基地。万和也是中国燃气具发展战略的首倡者和推动者、国家火炬计划重点高新技术企业、住建部授予的国家住宅产业化基地、中国航天事业合作伙伴。其燃气热水器市场占有率已连续十二年位在行业创领新高，消毒碗柜、燃气灶、吸油烟机、壁挂炉、电热水器的市场占有率均处行业前列，燃气热水器和燃气炉具的出口量连续多年领先行业同类产品。 阿里斯顿 阿里斯顿热能产品(中国)有限公司是全球领先的供暖热水系统及服务供应商，总部设在意大利北部城市法布里亚诺。上世纪九十年代初，阿里斯顿热能集团是最早将目光投向我国市场的欧洲企业之一，他们深信中国这片土地有着巨大发展潜力。集团首先将欧洲流行的电热水器引入我国市场，推出其主打品牌阿里斯顿ARISTON的电热水器系列产品，其电热水器带给人们全新的使用感受，很快人们便接受了这种卫生、方便、舒适的热水方式，产品迅速畅销，销量增长迅猛。阿里斯顿热能集团从此确立了在中国长期发展的信心。 菲斯曼 菲斯曼集团是世界领先的供热系统制造商之一，成立于1917年，企业全球拥有9600名员工，集团年销售额为18.6亿欧元。菲斯曼集团于 1997 年进入中国市场，2001 年作为德国菲斯曼集团在华子公司的北京菲斯曼供热技术有限公司在北京成立。2009 年菲斯曼在河北大厂建立生产工厂。今天，菲斯曼在中国已拥有约 260 名员工及 6 处代表机构。随着近几年迅猛发展起来的零售网络，菲斯曼在我国的合作伙伴已遍布全国所有省份。 依玛 意大利IMMERGAS集团创建于1964年，是意大利家用燃气壁挂炉设计、制造领域领导品牌。IMMERGAS一贯坚持将意大利品质、高效、低污染、原装的产品推向全球市场。而中国作为IMMERGAS最重视的海外市场，是其唯一一个欧洲之外建立分公司的国家。基于对我国市场的高度重视与深入理解，IMMERGAS于1997年将产品投放国内市场。今天IMMERGAS已将旗下全部五大系列十九个型号的燃气壁挂锅炉产品全部引入中国市场，以满足各地用户的需要。 贝尔塔 佛山市贝尔塔电器有限公司成立于2005年，是国内首家专业生产燃气采暖热水炉的企业。以专业领先的技术、完美可靠的品质，向社会提供舒适生活的热能系统。贝尔塔一系列的产品均通过国家质量技术监督局的检测认证，IS09001、IS014001、OHSAS18001认证，并获得英国BM认证机构颁发的UKAS证书。不仅在国内，在俄罗斯、意大利、土耳其、乌克兰、伊朗、埃及等多个国家和地区，贝尔塔开发了适合当地的高品质热能设备，降低碳排放，节省能源，为环境做出贡献，在诸多国家均享有较高美誉度。 法罗力 起源于欧洲意大利1955年的法罗力集团，享有“世界热值银行”的美誉，专注热能领域，以创新的精神、和对品质的不倦追求，成世界热能行业领导性品牌。法罗力集团具有热能行业最完整的产品线，在中国总投资超过7200万美元，是我国最大的外商投资热能企业。法罗力热能产品系列包括：冷凝和常规壁挂炉，集热水箱，太阳能集热器，散热器，以及钢制锅炉等 根据以上排行京东查询老家的房子是复式的150左右选择是24kw的，原本想买博世的，可惜博世的价格比较高而且不提供到家安装服务，所以最后选择了国有品牌小松鼠的。因为正好赶上双十二价格跟功率还是能满足使用。 下面是一些参考： 一般地区可参照如下参数进行选型：（根据建筑面积） 60到120平方的建议用18KW的炉子；120到180平方的建议用24KW的炉子； 180到220平方的建议用28KW的炉子； 220到260平方的建议用32KW的炉子；260到320平方的建议用36KW的炉子。 暖气片暖气片的话查询到国有的十大品牌如下：2016年暖气片十大品牌1——森德 森德（中国）暖通设备有限公司1995年成立于北京，森德控股集团总部设于瑞士森德公司，是钢制柱型散热器研发和推广者，并且迄今依然保持着世界高档散热器行业的领先地位。 2016暖气片十大品牌2——陇星（兰州） 兰州陇星沃尔凯采暖设备制造集团有限公司（以下简称陇星集团）创建于1998年，是一家以生产新型散热器、太阳能集热器等产品的多元化采暖品牌，企业的实力受到各界的认可。 2016暖气片十大品牌3——太阳花（广东） 太阳花始创于2001年，系广东省名牌产品。太阳花历经十多年的市场积淀，以其强大的研发能力荣获了多项产品专利，是国内暖气行业的佼佼者。 暖气片十大品牌4——金旗舰（北京） 金旗舰暖通科技有限公司前身是一家专业品牌暖通设备销售公司，金旗舰以科技谋发展，以服务赢市场。经过多年的品牌经营，拥有较佳的市场份额。 暖气片十大品牌5——圣劳伦斯（北京） 北京圣劳伦斯散热器制造有限公司是一家集研发、生产和销售一体的生产新型散热器的企业，自主研发钢制、铜铝复合等散热器，并于2015年起进军管材管件市场。 暖气片十大品牌6——南山（山东） 龙口市南山塑钢建材有限公司是南山集团骨干企业，是采暖散热器、塑料管材管件、塑料异型材大型生产企业，始创建于2000年，AAA级信誉及中国质量500强企业。 暖气片十大品牌7——努奥罗 努奥罗（中国）有限公司总部位于浙江省长兴经济开发区，建有占地15万平方米的努奥罗工业园，它是一家高新技术企业，其暖气片新颖、美观，数百家专卖店遍布全国各地。 暖气片十大品牌8——勃森（北京） 北京市天弘恒润工贸有限公司，始创于2002年，创新能力较强，自主研发生产有：钢制、铜铝复合、钛镁铝、地暖等产品，产品的高性价比得到了很多消费者的青睐。 暖气片十大品牌9——三叶（北京） 北京三叶散热器厂是中国建筑金属结构协会副主任单位，1971年研制生产第一代钢制散热器，至今已有45年的生产史，为北京建设做出了应有的贡献。 暖气片十大品牌10——鲁本斯（山东） 寿光市鲁本斯采暖设备有限公司总部位于山东省潍坊市。旗下产品有：钢制暖气片，铜铝复合暖气片，厨卫专用暖气片，艺术类暖气片等，同时提供优质的供暖产品周边配套产品。 根据以上排行京东查询圣劳伦斯和鲁本斯提供我们那里的上门服务，在京东上下了两家的测量的押金","categories":[],"tags":[{"name":"生活杂记","slug":"生活杂记","permalink":"http://www.yangshiqi.cn/tags/生活杂记/"}]},{"title":"C#转义字符","slug":"Char","date":"2017-12-05T07:35:04.000Z","updated":"2017-12-07T10:52:55.974Z","comments":true,"path":"year/12/05/Char/","link":"","permalink":"http://www.yangshiqi.cn/year/12/05/Char/","excerpt":"编程中很多细节问题我们都要十分的注意，要不一个小小的字母错误就能引起程序的无法运行。C#中转义字符分2中，一种是\\,一种是@。","text":"编程中很多细节问题我们都要十分的注意，要不一个小小的字母错误就能引起程序的无法运行。C#中转义字符分2中，一种是\\,一种是@。 @符号在C#中有两个作用作用1、在字符串的前面加@表示取消字符串中的转义例如 string path=@”d:\\root\\subdir”;作用2、如果用户定义的对象名和系统关键字冲突，可以在变量前面加入@例如 string @Class=”this is a test”; 转义字符 字符名称\\’ 单引号\\” 双引号\\ 反斜杠\\0 空字符\\a 警报符\\b 退格\\f 换页\\n 换行\\r 回车\\t 水平制表\\v 垂直制表 一 字符串中的用法Verbatim字符串 对于verbatim字符串，编译 器会严格按照原样对其进行解释。也就是说，即使这个字符串跨越多行，或是包含转义字符，编译器也将不予理会，即这些格式和转义符将按照原样输出。唯一例外的是引号，编译器必须将其转义，因为只有这样才能确定字符串的边界。 Verbatim字符串的定义语法为以@符号开始，后面紧跟包含在引号中的字符串。例如：string sample = @”Hello”;string sample = @”Hello\\tworld”; //生成Hello\\tworld以下是一个实用的示例：string sample=@”C:\\My Documents\\sample.txt”;//结果为：C:\\My Documents\\sample.txt，如同语句：string sample=”C:\\My Documents\\sample.txt” 若想在Verbatim字符串内使用引号，必须使用附加的引号组将其转义。例如，生成字符串”Hi”的代码如下：String s=@” “ “Hi”””; //注意：两边都有3个引号上述代码将生成下列字符串：“Hi” 字符@表示，其后的字符串是个“逐字字符串”(verbatim string)。@只能对字符串常量作用。1.用于文件路径以下是引用片段：string s_FilePath =”C:\\Program Files\\Microsoft.NET\\test.txt”;相当于以下是引用片段：string s_FilePath =@”C:\\Program Files\\Microsoft.NET\\test.txt”; 2.用@表示的字符串能够跨越数行。用于在CS中写JS或SQL代码比较方便。以下是引用片段：string s_MultiRows = @”Line1Line2Line3”;string s_JavaScript = @”“; 二 标识符中的用法 在 C# 规范中, @ 可以作为标识符(类名、变量名、方法名等)的第一个字符，以允许C# 中保留关键字作为自己定义的标识符。如以下是引用片段：class @class{public static void @static(bool @bool) {if (@bool)System.Console.WriteLine(“true”);elseSystem.Console.WriteLine(“false”);}}class Class1{static void M() {clu0061ss.stu0061tic(true);}} 注意，@ 虽然出现在标识符中，但不作为标识符本身的一部分。因此，以上示例，定义了一个名为 class 的类，并包含一个名为 static 的方法，以及一个参数名为了 bool 的形参。 这样，对于跨语言的移植带来了便利。因为，某个单词在 C# 中作为保留关键字，但是在其他语言中也许不是。 转自作者 HanbGao 地址：https://www.cnblogs.com/muran/p/3174865.html","categories":[],"tags":[{"name":"C#","slug":"C","permalink":"http://www.yangshiqi.cn/tags/C/"}]},{"title":"算法第四版_二分法","slug":"BinarySearch","date":"2017-11-30T10:13:17.000Z","updated":"2017-12-07T10:53:00.245Z","comments":true,"path":"year/11/30/BinarySearch/","link":"","permalink":"http://www.yangshiqi.cn/year/11/30/BinarySearch/","excerpt":"二分查找又称折半查找，优点是比较次数少，查找速度快，平均性能好，占用系统内存较少；其缺点是要求待查表为有序表，且插入删除困难。因此，折半查找方法适用于不经常变动而查找频繁的有序列表。首先，假设表中元素是按升序排列，将表中间位置记录的关键字与查找关键字比较，如果两者相等，则查找成功；否则利用中间位置记录将表分成前、后两个子表，如果中间位置记录的关键字大于查找关键字，则进一步查找前一子表，否则进一步查找后一子表。重复以上过程，直到找到满足条件的记录，使查找成功，或直到子表不存在为止，此时查找不成功。","text":"二分查找又称折半查找，优点是比较次数少，查找速度快，平均性能好，占用系统内存较少；其缺点是要求待查表为有序表，且插入删除困难。因此，折半查找方法适用于不经常变动而查找频繁的有序列表。首先，假设表中元素是按升序排列，将表中间位置记录的关键字与查找关键字比较，如果两者相等，则查找成功；否则利用中间位置记录将表分成前、后两个子表，如果中间位置记录的关键字大于查找关键字，则进一步查找前一子表，否则进一步查找后一子表。重复以上过程，直到找到满足条件的记录，使查找成功，或直到子表不存在为止，此时查找不成功。 从这里我们可以了解二分查找适用于有序表，下面我们可以看一下用C#实现的二分查找 二分查找 递归12345678910111213141516171819///&lt;param name=&quot;arr&quot;&gt;数组&lt;/param&gt;///&lt;param name=&quot;low&quot;&gt;开始索引 0&lt;/param&gt;///&lt;param name=&quot;high&quot;&gt;结束索引 &lt;/param&gt;///&lt;param name=&quot;key&quot;&gt;要查找的对象&lt;/param&gt;public static int BinarySearch(int[] arr, int low, int high, int key)&#123; int mid = (low + high) / 2; if (low &gt; high) return -1; else &#123; if (arr[mid] == key) return mid; else if (arr[mid] &gt; key) return BinarySearch(arr, low, mid - 1, key); else return BinarySearch(arr, mid + 1, high, key); &#125;&#125; 二分查找 非递归123456789101112131415///&lt;param name=&quot;arr&quot;&gt;数组&lt;/param&gt;///&lt;param name=&quot;key&quot;&gt;要查找的对象&lt;/param&gt;public static int BinarySearch(int key,int[] arr)&#123; int low = 0; int max = arr.Length - 1; while (low&lt;=max) &#123; int mid = low + (max - low) / 2; if (key &lt;arr[ mid]) max = mid - 1; else if (key &gt;arr[ mid]) low = mid + 1; else return mid; &#125; return -1;&#125;","categories":[],"tags":[{"name":"算法第四版","slug":"算法第四版","permalink":"http://www.yangshiqi.cn/tags/算法第四版/"},{"name":"基础知识","slug":"基础知识","permalink":"http://www.yangshiqi.cn/tags/基础知识/"}]},{"title":"hexo的使用","slug":"HexoUse","date":"2017-10-16T07:37:43.000Z","updated":"2017-12-07T10:52:52.264Z","comments":true,"path":"year/10/16/HexoUse/","link":"","permalink":"http://www.yangshiqi.cn/year/10/16/HexoUse/","excerpt":"hexo new “postName” #新建文章hexo new page “pageName” #新建页面hexo generate #生成静态页面至public目录","text":"hexo new “postName” #新建文章hexo new page “pageName” #新建页面hexo generate #生成静态页面至public目录hexo server #开启预览访问端口（默认端口4000，’ctrl + c’关闭server）hexo deploy #部署到GitHubhexo help #查看帮助hexo version #查看Hexo的版本 缩写 :hexo n == hexo newhexo g == hexo generatehexo s == hexo serverhexo d == hexo deploy 组合命令 :hexo s -g #生成并本地预览hexo d -g #生成并上传","categories":[],"tags":[{"name":"Hexo","slug":"Hexo","permalink":"http://www.yangshiqi.cn/tags/Hexo/"}]},{"title":"Hello,World","slug":"Hello-World","date":"2017-10-05T08:02:49.000Z","updated":"2017-12-07T10:52:48.138Z","comments":true,"path":"year/10/05/Hello-World/","link":"","permalink":"http://www.yangshiqi.cn/year/10/05/Hello-World/","excerpt":"","text":"Unity板砖工，web乱搞协会成员，欢迎大家来到我的农田！","categories":[],"tags":[{"name":"随笔","slug":"随笔","permalink":"http://www.yangshiqi.cn/tags/随笔/"}]}]